Revit 2027 API
CustomInitialColor.Temperature Property
 The custom color temperature value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Temperature { get; set; }
Public Property Temperature As Double
	Get
	Set
public:
property double Temperature {
	double get ();
	void set (double value);
}
member Temperature : float with get, set
Property Value
Double
 The color temperature in Kelvin as a numerical value between 1800 and 20000
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The color temperature is not valid because it is not in the range of 1800 to 20000.
See Also
Reference
CustomInitialColor Class
Autodesk.Revit.DB.Lighting Namespace